# RebarShapeFailureCustomWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..RebarShapeFailureCustomWarning Property
BuiltInFailures..::..RebarFailures Class See Also
---
'[ErrorMessage]'
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RebarShapeFailureCustomWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarShapeFailureCustomWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RebarShapeFailureCustomWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace